<a href="https://colab.research.google.com/github/Asfak21/Python-Practice/blob/main/SQL_Revision.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Some of The Most Important SQL Commands
SELECT - extracts data from a database  
UPDATE - updates data in a database  
DELETE - deletes data from a database  
INSERT INTO - inserts new data into a database  
CREATE DATABASE - creates a new database  
ALTER DATABASE - modifies a database  
CREATE TABLE - creates a new table  
ALTER TABLE - modifies a table  
DROP TABLE - deletes a table  
CREATE INDEX - creates an index (search key)  
DROP INDEX - deletes an index

**SELECT query:**

SELECT column1, column2, ...
FROM table_name;

example:
SELECT columname1, columnname2 FROM tablename

**WHERE query**

SELECT column1, column2, ...
FROM table_name
WHERE condition1 AND condition2 AND condition3 ...

**DISTINCT query**

SELECT DISTINCT  column FROM table

**Order By Query**

SELECT * FROM Customers
ORDER BY Country DESC

SELECT * FROM Customers
ORDER BY Country ASC

**SELECT and WHERE for filtering and selection:**

SELECT *

FROM employees


WHERE department = 'Sales';



**COUNT, SUM, MAX, GROUP BY, HAVING for aggregating data:**

SELECT department, COUNT(*) as employee_count, AVG(salary) as average_salary


FROM employees

GROUP BY department

HAVING average_salary > 50000;




**DISTINCT, COUNT DISTINCT for producing useful distinct lists and distinct aggregates:**


SELECT DISTINCT department

 FROM employees;


**OUTER (e.g. LEFT) and INNER JOIN when/where to use them:**

SELECT customers.name, orders.order_number

FROM customers

LEFT JOIN orders ON customers.id = orders.customer_id;


**Strings and time conversions:**

SELECT CONCAT(first_name, ' ', last_name) AS full_name,
       DATE_FORMAT(birth_date, '%Y-%m-%d') AS formatted_birth_date

FROM employees;

**UNION and UNION ALL:**

SELECT column1

FROM table1

UNION

SELECT column1 FROM table2;

**GROUP BY Statement**

SELECT column_name(s)
FROM table_name
WHERE condition
GROUP BY column_name(s)
ORDER BY column_name(s);


The GROUP BY statement is often used with aggregate functions (COUNT(), MAX(), MIN(), SUM(), AVG()) to group the result-set by one or more columns.

**CASE Syntax**

CASE

    WHEN condition1 THEN result1
    WHEN condition2 THEN result2
    WHEN conditionN THEN resultN
    ELSE result
    
END;

Intermediate:

**DML/DDL/DCL concepts:**


DML - INSERT INTO employees VALUES ('John', 'Doe', 'Sales');

DDL - CREATE TABLE employees (first_name VARCHAR(50), last_name VARCHAR(50), department VARCHAR(50));

DCL - GRANT SELECT, INSERT ON employees TO 'user1';


**Handling NULLS creatively (e.g. with COALESCE):**


SELECT first_name, COALESCE(middle_name, 'N/A') AS middle_name, last_name

FROM employees;

**Subqueries and the impact of subqueries on efficiency of the query:**

SELECT first_name, last_name

FROM employees

WHERE department IN (SELECT department FROM managers WHERE manager_name = 'John');

**Temporary tables:**


CREATE TEMPORARY TABLE temp_table AS
SELECT *

FROM employees

WHERE department = 'Sales';

SELECT *

FROM temp_table;

**Self joins:**

SELECT e1.name AS employee_name, e2.name AS manager_name

FROM employees e1

INNER JOIN employees e2 ON e1.manager_id = e2.id;

**Window functions like PARTITION, LEAD, LAG, NTILE:**

SELECT department, salary,
       ROW_NUMBER() OVER (PARTITION BY department ORDER BY salary DESC) AS rank

FROM employees;

**UDFs (user-defined functions):**

CREATE FUNCTION calculate_age(birth_date DATE) RETURNS INT
BEGIN
    RETURN YEAR(CURRENT_DATE()) - YEAR(birth_date);
END;

SELECT first_name, last_name, calculate_age(birth_date) AS age

FROM employees;

**Use of indexes in querying to make operations faster:**

CREATE INDEX idx_department ON employees (department);

SELECT *
FROM employees WHERE department = 'Sales';

**CTE (Common Table Expressions):**

WITH sales_employees AS (
    SELECT * FROM employees WHERE department = 'Sales'
)
SELECT *
FROM sales_employees;